In [1]:
#Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:
#How many distinct (different) actors' last names are there?
#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
#Get all films with ARMAGEDDON in the title.
#Get 10 the longest films.
#How many films include Behind the Scenes content?
#Which kind of movies (rating) have a mean duration of more than two hours?
#Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [10]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

# Create a Python connection with SQL database

In [11]:
password = getpass.getpass()

········

In [12]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

# Queries

### How many distinct (different) actors' last names are there?

In [13]:
data1 = pd.read_sql_query(
'''

select count(distinct last_name) as cnt from actor;

''', engine)
data1.head()

   cnt
0  121

### Additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [19]:
data2 = pd.read_sql_query(
'''
select *,
case  
when date_format(rental_date,"%%w") in (1,2,3,4,5) then "workday"
when date_format(rental_date,"%%w") in (0,6) then "weekend"
end 
from rental
''', engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,"case \nwhen date_format(rental_date,""%w"") in (1,2,3,4,5) then ""workday""\nwhen date_format(rental_date,""%w"") in (0,6) then ""weekend""\nend"
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 22:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 22:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 22:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 22:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 22:30:53,workday

### Get all films with ARMAGEDDON in the title.

In [21]:
data3 = pd.read_sql_query('''SELECT title FROM film
WHERE title like "%%ARMAGEDDON%%";''', engine)
data3.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

### Get 10 the longest films.

In [22]:
data4 = pd.read_sql_query('''SELECT title, length FROM sakila.film
ORDER BY length DESC   
LIMIT 10;''', engine)
data4.head(11)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

### How many films include Behind the Scenes content?

In [8]:
data5 = pd.read_sql_query('''SELECT count(special_features) FROM film
WHERE special_features like '%%Behind the Scenes%%';''', engine)
data5.head()

   count(special_features)
0                      538

### Which kind of movies (rating) have a mean duration of more than two hours?

In [24]:
data6 = pd.read_sql_query('''SELECT rating, ROUND(AVG(length),2) as "average length" from film
GROUP by rating
HAVING ROUND(AVG(length),2)>120;''', engine)
data6.head()

  rating  average length
0  PG-13          120.44

### Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [25]:
data7 = pd.read_sql_query('''SELECT length, title, 
RANK() OVER   
    (ORDER BY length ASC) AS "Rank"  
from film
WHERE length <> ' ';''', engine)
data7.head()

   length                title  Rank
0      46         ALIEN CENTER     1
1      46            IRON MOON     1
2      46        KWAI HOMEWARD     1
3      46     LABYRINTH LEAGUE     1
4      46  RIDGEMONT SUBMARINE     1